Merge pull request #1 from tcynic/feature/json-store
Feature/json store
